Public Attributes | List of all members
API_RailingFinishType Struct Reference
Element Manager API
Represents the finish of a Rail End element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_Elem_Head  | head
General element header.
API_Guid  | owner
GUID of the Rail End element owning this Finish.
API_Guid  | symbID
The identifier of the symbol of this element.
Detailed Description
Represents the finish of a Rail End element.
Member Data Documentation
◆ head
 API_RailingFinishType::head
General element header.
◆ owner
 API_RailingFinishType::owner
GUID of the Rail End element owning this Finish.
◆ symbID
 API_RailingFinishType::symbID
The identifier of the symbol of this element.